{
  "main": {
    "name": "Samer Khatib",
    "occupation": "Software Engineer",
    "image": "profilepic.jpg",
    "bio": "I am a scientist at heart, with an apt knack for coming up with a unique solution to every problem I face. My passion for software engineering allows me to translate this love for problem-solving into code, solving inconveniences with novel ideas. Currently, I am researching ways that I can extend my skills into a Software Engineering role in a tech or business field. Outside of my projects and school, I am also an avid fan of Aviation and NCAA Wrestling. Whether it's discussing the latest tournament or trends in the airline industry, I'm always open to engaging in meaningful conversations. Feel free to drop me an email and kick-start the dialogue!",
    "contactmessage": "Send me a message!",
    "email": "s.khatib@ufl.edu",
    "phone": "(630) 649-9306",
    "address": {
      "street": "950 NW 7th Lane",
      "city": "Gainesville",
      "state": "Florida",
      "zip": "32601"
    },
    "website": "https://samerkhatib.com/",
    "resumedownload": "https://docs.google.com/gview?url=https://github.com/skhatib07/resume/raw/main/khatib_samer_resume.pdf&embedded=true",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/skhatib07/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/samer_m_khatib",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/samer-khatib/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/skhatib07/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/skhatib07",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here are some of my favorite Software Programs & Libraries",
    "education": [
      {
        "school": "University of Florida",
        "degree": "Bachelors in Computer Engineering",
        "graduated": "May 2025",
        "description": "Major in Computer Engineering with a focused specialization in Artificial Intelligence and Quantitative Research, engaging in hands-on projects involving Reconfigurable Computing to optimize Quantitative calculations. I have taken a deep academic interest in the Financial Technology side of the Engineering industry, and I am excited to see how the skills I have earned through my specialties can be translated to the Fintech Industry."
      }
    ],
    "work": [
          {
            "company": "Chime Financial, Inc.",
            "title": "Software Engineering Intern",
            "years": "May 2024 - August 2024",
            "description": "I made significant contributions to data analysis and backend optimization. One of my key projects involved designing and building a Statistical Power Calculator, an essential tool used to evaluate the statistical robustness of A/B tests and experiments. This solution was powered by an AWS Lambda Function, allowing for scalable, serverless execution. The core functionality of the calculator was implemented through a Python script that interfaced with a Snowflake Database, querying large datasets to calculate Statistical Power, Sample Size, Significance Level (alpha), and Expected Effect Size. By doing so, I helped streamline the process for data scientists and engineers to assess experiment designs and determine the necessary parameters for achieving statistically meaningful results. In another project, I focused on performance optimization of a Golang Program designed to handle API requests at scale. My primary goal was to enhance the speed and efficiency of the API endpoint by introducing multi-threaded computing techniques and improving the underlying algorithms. This allowed the application to better manage concurrent requests, significantly reducing response times while maintaining throughput. These projects strengthened my technical expertise in cloud computing and data analysis, allowing me to gain valuable insights into large-scale system architecture and performance tuning."
          },
          {
        "company": "Cisco Meraki",
        "title": "Full Stack Software Engineering Intern",
        "years": "June - August 2023 & May - August 2022",
        "description": "I played a key role in enhancing team system capabilities by implementing a new API endpoint in Ruby on Rails, facilitating the download of binary device blobs and configuration of device characteristics for a Wireless Access Point. This involved transforming rows from a PostgreSQL database into a versatile Comma Separated Value (CSV) format. Another task I worked on was the development of a Go Package to refine the output of a command-line tool, providing the flexibility to display results in either ASCII Tabular or serialized JSON format. This project eventually evolved into the design and construction of a HashiCorp Terraform Provider. The Terraform Provider allowed seamless access to the Meraki Dashboard through the Terraform Plugin Framework, streamlining the deployment process for vMX Devices for both Production and Development purposes. These two internships greatly sharpened my skills in software engineering, and given me valuable insights into entering an unknown space and conquering difficult problems with a solution-oriented mindset."
      },
      {
        "company": "DigiConnect LLC.",
        "title": "Software Engineering Intern",
        "years": "May 2021 - August 2021",
        "description": "I successfully launched a native third-party client application for a social advocacy website, leveraging Swift for iOS and Java for Android development. With the goal of increasing codebase efficiency, I orchestrated the migration of the native application codebase to a shared language, Dart, utilizing Google's Flutter Software Development Kit. Additionally, I led a comprehensive overhaul of the website's user interface, using React JS for its graphical enhancements. I cleaned up the complicated data pipeline, and simplified it by using Apache Spark for load management and Firebase for authentication. These experiences not only enriched my technical skills, but also contributed to creating innovative and user-friendly solutions for consumer-facing products under strict time requirements."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "Mastering Git version control was among my initial milestones as a software engineer. Today, Git remains an indispensable part of my development toolkit, seamlessly integrated into every project. I've harnessed the power of Git not only for managing my personal repositories but also as a collaborative force in contributing to diverse Open Source Projects. It's not just a version control system for me; it's a dynamic tool that empowers collaboration and drives the success of my coding ventures.",
        "image": "git.jpg"
      },
      {
        "name": "Java",
        "description": "Embarking on my coding journey in AP Computer Science during my Senior year of High School, Java became my inaugural programming language. I immersed myself in learning the intricacies of Java, eager to grasp its foundations. Swiftly applying my newfound skills, I undertook my maiden personal project, a testament to my commitment to continuous learning. Delve into the source code of this project, a reflection of my early passion and proficiency in Java, below!",
        "image": "java.jpg"
      },
      {
        "name": "React JS",
        "description": "My journey to unravel the complexites of React JS has been my primary focus in recent months, investing considerable time to comprehend the language's dynamics. Gradually, React won me over with its remarkable flexibility, igniting my enthusiasm for its potential. Eager to embrace the learning curve, I look forward to leveraging React in my upcoming projects. Notably, this very website stands as a testament to my evolving proficiency in React, showcasing its capabilities in action!",
        "image": "react.jpg"
      },
      {
        "name": "Flutter",
        "description": "Exploring Flutter marked a pivotal point in my coding journey. Overcoming initial challenges, I embraced its widget-based architecture, captivated by its cross-platform prowess. Navigating the intricacies, I found joy in crafting seamless, responsive apps. Flutter's single-codebase magic resonated with me, streamlining development. Proficient now, I'm excited to wield Flutter's power in diverse projects, optimizing UI/UX and exploring innovative design patterns. I look forward to contributing to the vibrant community of Flutter developers.",
        "image": "flutter.jpg"
      },

      {
        "name": "C++",
        "description": "C++ emerged as my second programming language during my inaugural year at the University of Florida, becoming a cornerstone in my academic journey. I harnessed its power to delve into the realms of Data Structures and Algorithms, unlocking a deeper understanding of software craftsmanship. C++'s low-level architecture and swift compilation times became invaluable companions, empowering me to develop efficient, high-performance solutions. Today, I carry forward the insights gained, cherishing C++ as a versatile tool that combines elegance with efficiency in the ever-evolving landscape of programming.",
        "image": "c++.jpg"
      },
      {
        "name": "Python",
        "description": "Python, a pivotal addition to my Software Engineering odyssey, entered my toolkit as one of the more recent languages I embraced. Initially drawn by its prowess in machine learning and artificial intelligence, Python has evolved into a steadfast companion in my coding endeavors. Beyond its immediate applications, I am captivated by Python's expanding relevance, envisioning its continued role in shaping the future of software development. This multifaceted language has not only enriched my skill set but also opened doors to a spectrum of possibilities that I eagerly explore and integrate into my projects.",
        "image": "python.jpg"
      },
      {
        "name": "Amazon Web Services",
        "description": "Embracing Amazon Web Services (AWS) has been a transformative experience in my project journey. The impact of integrating AWS into my workflow has been profound, revolutionizing the way I approach and execute projects. The robust capabilities of AWS, particularly in databases and virtual machines, have become indispensable tools that I now rely on extensively. As I navigate the vast landscape of cloud services, AWS stands out as a cornerstone, and I anticipate its pervasive role in shaping the architecture of my future projects.",
        "image": "aws.jpg"
      },
      {
        "name": "Pytorch",
        "description": "PyTorch has emerged as the linchpin of my machine learning endeavors, serving as the cornerstone for my exploration into this dynamic field. The intuitive design of PyTorch has not only simplified the complexities of machine learning but has also provided a real-time lens into the training processes, offering a unique and insightful experience. In a recent undertaking – the YOLO-ALPR project – PyTorch's capabilities shone brightly, powering the project's success. Dive into the source code below to witness firsthand the synergy between PyTorch and cutting-edge machine learning projects.",
        "image": "pytorch.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "VaccinApp - COVID-19 Vaccine Locator",
        "category": "(offline) Command-line based Personal Project to locate nearest vaccine location to user",
        "image": "vaccinApp.jpg",
        "url": "https://github.com/skhatib07/Vaccinapp"
      },
      {
        "title": "YOLO-ALPR - Automatic License Plate Detection & Recognition",
        "category": "(WIP) A lightweight license plate detection system",
        "image": "yoloALPR.jpg",
        "url": "https://github.com/mmhobi7/LPS"
      },
      {
        "title": "Myoelectrics - Natural Robotic Hand & Actuation",
        "category": "Research Project on the development of an ultra low-cost myoelectric prosthetic",
        "image": "myo.jpg",
        "url": "https://gitlab.com/skhatib/myoelectrics"
      },
      {
        "title": "Personal Portfolio Website",
        "category": "A React based resume website I developed. You're looking at it right now!",
        "image": "resume-website.jpg",
        "url": "https://samerkhatib.com/"
      }
    ]
  }
}
