{
  "main": {
    "name": "Samer Khatib",
    "occupation": "Software Engineer",
    "image": "profilepic.jpg",
    "bio": "Use this bio section as your way of describing yourself and saying what you do, what technologies you like to use or feel most comfortable with, describing your personality, or whatever else you feel like throwing in.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "skhatib07@outlook.com",
    "phone": "(630) 649-9306",
    "address": {
      "street": "3664 Southwest 24th Avenue",
      "city": "Gainesville",
      "state": "Florida",
      "zip": "32607"
    },
    "website": "https://samerkhatib.com/",
    "resumedownload": "https://docs.google.com/gview?url=https://github.com/skhatib07/resume/raw/main/khatib_samer_resume.pdf&embedded=true",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/skhatib07/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/samer_m_khatib",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/samer-khatib-47287517b/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/skhatib07/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/skhatib07",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here are some of my favorite Software Programs & Libraries",
    "education": [
      {
        "school": "University of Florida",
        "degree": "Bachelors in Computer Engineering",
        "graduated": "May 2023",
        "description": "Double Minor in Biomolecular Engineering and Business Administration. I am truly enjoying the wide variety of material I am learning at the University of Florida. I am excited to continue to grow as a student as well as a Software Engineer."
      }
    ],
    "work": [
      {
        "company": "DigiConnect LLC.",
        "title": "Software Engineering Intern",
        "years": "May 2021 - August 2021",
        "description": "Launched native third-party client application for several social networking sites using Swift (iOS) & Java (Android). Migrated native application code base into a shared language (Dart) using Google’s Flutter Software Development Kit. Overhauled Website UI using React for graphical adjustments with a data pipeline built on Apache Spark & Firebase."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image": "git.jpg"
      },
      {
        "name": "Java",
        "description": "Java was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image": "java.jpg"
      },
      {
        "name": "React JS",
        "description": "I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website template (link below in portfolio) which I used as a starting point for this personal site.",
        "image": "react.jpg"
      },
      {
        "name": "Flutter",
        "description": "I enjoy MeteorJS for it's ease of configuration and its ability to get a full stack prototype up and running quickly. I used MeteorJS in a team for a Startup Programming class in UVIC in conjunction with React to build the MVP for Smirkspace (below in portfolio)",
        "image": "flutter.jpg"
      },

      {
        "name": "C++",
        "description": "Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with MeteorJS-based projects",
        "image": "c++.jpg"
      },
      {
        "name": "Python",
        "description": "I use Bootstrap more often than not when designing the layout for my sites. It is the framework I am most familiar with and can therefore design more quickly than with others.",
        "image": "python.jpg"
      },
      {
        "name": "Amazon Web Services",
        "description": "I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image": "aws.jpg"
      },
      {
        "name": "Pytorch",
        "description": "I use Heroku as my hosting platform for most of my projects because so far they are all unpaid and their free tier is convenient. I also appreciate its integration with Github for such simple deployment.",
        "image": "pytorch.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "VaccinApp - COVID-19 Vaccine Locator",
        "category": "(offline) Command-line based Personal Project to locate nearest vaccine location to user",
        "image": "canadian-wanderlust.jpg",
        "url": "https://github.com/skhatib07/Vaccinapp"
      },
      {
        "title": "YOLO-ALPR - Automatic License Plate Detection & Recognition",
        "category": "(WIP) A lightweight license plate detection system",
        "image": "fury-fighting-gear.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Myoelectrics - Natural Robotic Hand & Actuation",
        "category": "Research Project on the development of an ultra low-cost myoelectric prosthetic",
        "image": "original-thai-food.jpg",
        "url": "http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title": "Personal Portfolio Website",
        "category": "A React based resume website I developed. You're looking at it right now!",
        "image": "resume-website.jpg",
        "url": "https://samerkhatib.com/"
      }
    ]
  }
}
