{
  "main": {
    "name": "Samer Khatib",
    "occupation": "Software Engineer",
    "image": "profilepic.jpg",
    "bio": "I am a scientist at heart, with an apt knack for coming up with a unique solution to every problem I face. I use my love for science and passion for software engineering to code a resolution to every inconvenience I come across. Currently, I am researching ways that I can extend my skills into a Software Engineering role in a tech or business field. Outside of my projects and school, I love to play volleyball or Pokemon Unite with my friends. I'm also an avid fan of Aviation and NCAA Wrestling. I'm always open to having a discussion about the most recent tournament or the latest trend in the airline industry. Feel free to send me an email and start the conversation!",
    "contactmessage": "Send me a message!",
    "email": "skhatib07@outlook.com",
    "phone": "(630) 649-9306",
    "address": {
      "street": "3664 Southwest 24th Avenue, Unit 202",
      "city": "Gainesville",
      "state": "Florida",
      "zip": "32607"
    },
    "website": "https://samerkhatib.com/",
    "resumedownload": "https://docs.google.com/gview?url=https://github.com/skhatib07/resume/raw/main/khatib_samer_resume.pdf&embedded=true",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/skhatib07/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/samer_m_khatib",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/samer-khatib-47287517b/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/skhatib07/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/skhatib07",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here are some of my favorite Software Programs & Libraries",
    "education": [
      {
        "school": "University of Florida",
        "degree": "Bachelors in Computer Engineering",
        "graduated": "May 2023",
        "description": "Double Minor in Biomolecular Engineering and Business Administration. I am truly enjoying the wide variety of material I am learning at the University of Florida. I am excited to continue to grow as a student as I continue through my coursework towards my degrees."
      }
    ],
    "work": [
      {
        "company": "DigiConnect LLC.",
        "title": "Software Engineering Intern",
        "years": "May 2021 - August 2021",
        "description": "Launched native third-party client application for several social networking sites using Swift (iOS) & Java (Android). Migrated native application code base into a shared language (Dart) using Google’s Flutter Software Development Kit. Overhauled Website UI using React for graphical adjustments with a data pipeline built on Apache Spark & Firebase."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "Git version control was one of the first programs I learned when I started coding. Nowadays, I use git for every one of my projects and have utilized it to contribute to several Open Sourced Projects.",
        "image": "git.jpg"
      },
      {
        "name": "Java",
        "description": "Java was my first programming language that I learned in AP Computer Science my Senior year of High School. I learned as much of the language as I could and utilized it for my first personal project. The source code is available below!",
        "image": "java.jpg"
      },
      {
        "name": "React JS",
        "description": "I am fairly new to React and it took me awhile to understand the dynamics of the language. It grew on me quickly though for it's flexibility and I'm excited to continue using it for my future projects. This website is built using React!",
        "image": "react.jpg"
      },
      {
        "name": "Flutter",
        "description": "Flutter was one of the most recent languages I learned. Even though it was difficult to understand the widget-based language, I quickly fell in love with the cross-platform capabilities offered by the language and look forward to continue using it.",
        "image": "flutter.jpg"
      },

      {
        "name": "C++",
        "description": "I learned C++ as my second main programming language in my first year of college at the University of Florida. I utilized C++ as a catalyst for learning Data Structures and Algorithms and I continue to value the language for it's low-level architecture and quick compilation times.",
        "image": "c++.jpg"
      },
      {
        "name": "Python",
        "description": "Python was one of the more recent languages that I learned in my Software Engineering journey. I learning it primarily for it's machine learning/artificial intelligence capabilities but I continue to use it due to it's potential future applications as the language becomes more relevant.",
        "image": "python.jpg"
      },
      {
        "name": "Amazon Web Services",
        "description": "I only recently started using Amazon Web Services for my projects, and I can't imagine how I operated without it. It's database & virtual machine capabilites are ones that I see myself frequently using in the future for in all my projects.",
        "image": "aws.jpg"
      },
      {
        "name": "Pytorch",
        "description": "Pytorch is the main library that I use for machine learning. I really enjoy the easability of use Pytorch offers it's users as well as the ability to view the training processes in real time. I have most recently used Pytorch in my YOLO-ALPR project, which you can see the source code for below!",
        "image": "pytorch.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "VaccinApp - COVID-19 Vaccine Locator",
        "category": "(offline) Command-line based Personal Project to locate nearest vaccine location to user",
        "image": "vaccinApp.jpg",
        "url": "https://github.com/skhatib07/Vaccinapp"
      },
      {
        "title": "YOLO-ALPR - Automatic License Plate Detection & Recognition",
        "category": "(WIP) A lightweight license plate detection system",
        "image": "yoloALPR.jpg",
        "url": "https://github.com/mmhobi7/LPS"
      },
      {
        "title": "Myoelectrics - Natural Robotic Hand & Actuation",
        "category": "Research Project on the development of an ultra low-cost myoelectric prosthetic",
        "image": "myo.jpg",
        "url": "https://gitlab.com/skhatib/myoelectrics"
      },
      {
        "title": "Personal Portfolio Website",
        "category": "A React based resume website I developed. You're looking at it right now!",
        "image": "resume-website.jpg",
        "url": "https://samerkhatib.com/"
      }
    ]
  }
}
